Autodesk.Revit.UI.ExternalDataManagerDataItem.SetId(Autodesk.Revit.UI.ExternalDataManagerDataItemId)
Sets the id of the data item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.GetId
Gets the id of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExternalDataManagerDataItem.ScenarioVersion
The scenario version of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.ScenarioName
The scenario name of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.PositionsNotSaved
The positions not saved of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.LocalAlias
The local alias of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Version
The version of the data item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Count
The count of the data item.
Remarks:
The default value is -1, means this property is nonsense.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.PathTypeEditable
Checks if the path type is editable or not.
Remarks:
If it is editable, the path type can be changed from absolute to relative or vice versa.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.PathType
The path type of the saved path (e.g. "Absolute", "Relative", "Cloud").
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Path
The saved path of the data item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Resolution
The width and height of a image data item if applicable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Size
The file size (Bytes) of the data item if applicable.
Remarks:
The default value is -1, means this property is nonsense.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.ReferenceType
The reference type of the data item (e.g. "Import", "Link", "Overlay", "Attachment").
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Status
The status of the data item.
Remarks:
The default value is LinkedFileStatus::Invalid, means this property is nonsense.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.Name
The name of the data item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.#ctor(Autodesk.Revit.UI.ExternalDataManagerDataItemId)
Constructor
id:
The id of the data item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem.#ctor(Autodesk.Revit.UI.ExternalDataManagerDataItem)
Create a copy of the object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItem
Represents an item of the extenal data.
Remarks:
A lightweight, UI-friendly wrapper around a piece of external data (image, model,
point-cloud, etc.). Instances are returned by IExternalDataManagerServer.getData and
displayed in the Manage Links dialog.
Important implementation notes for server authors:
Most properties are optional, so leave them at their default values when the
information is not available. The dialog will gracefully hide columns that
contain only default/invalid values.
All user-visible strings (Name, ReferenceType, PathType) must be localized
before they are passed to Revit.
The identity (Id) must stay stable for the lifetime of the dialog session so
that selections and previews remain valid.
Consumers of this class (typically the UI) should treat objects as immutable once
they have been handed over, and the server is responsible for creating fresh
instances when data changes.
Since:
2027